import math

# Δεδομένα
Vm = 150.0  # Μέγιστη τιμή της AC τάσης σε volts
w = 100 * 2 * math.pi  # Συχνότητα σε rad/s
R = 40.0  # Αντίσταση σε ohms
L = 80.0e-3  # Αυτεπαγωγή σε henrys
C = 50.0e-6  # Χωρητικότητα σε farads

# Υπολογισμός μέγιστων τιμών πτώσεων δυναμικού
VR0 = Vm  # Σταθερή αντίσταση, η πτώση είναι ίση με την τάση
VL0 = Vm * (w * L)  # Πτώση λόγω του πηνίου
VC0 = Vm / (w * C)  # Πτώση λόγω του πυκνωτή

# Εκτύπωση αποτελεσμάτων
print("(α) Τάση VR0:", VR0, "V")
print("(β) Τάση VL0:", VL0, "V")
print("(γ) Τάση VC0:", VC0, "V")
